app/mailers/user_mailer.rb

  def reminder_email(task)
    @task_name = task.name
    @task_deadline = task.deadline
    @email = User.find(task.user_id).email
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]