app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("name", "description", "status", "deadline", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @tasks = current_user.tasks
    @task = current_user.tasks.build(task_params)
    # client = get_google_calendar_client current_user
    # event = get_event(@task)
    # client.insert_event('primary', event)

    respond_to do |format|
      if @task.save

UPDATE "tasks" SET "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["status", "done"], ["updated_at", "2021-07-05 06:24:44.408507"], ["id", 30]]
---
  def update
    @tasks = current_user.tasks
    respond_to do |format|
      if @task.update(task_params)